#+TITLE: Terminal configuration
#+AUTHOR: Ivan Higuera-Mendieta

Living in the white Terminal is boring. In this documents we will review some small hacks to adapt
the terminal to the modern standards, like auto-complete, coloring, and more! 

** Configuration files: 

All Unix machines have different types of configuration files. Usually, this configuration files are
located in the home folder (~/Users/$(whoami)~) and have a dot before their name. Hence the name
/dotfiles/ (also, all files with a dot before the filename are considered hidden, so ~ls~ or the
normal Finder will not list them). Depending on the type of shell, you will have more/less options
for personalization.

By default in MacOS machines, the shell configuration file is ~.bash_profile~. If you are using a
Linux terminal, the configuration file will be ~.bashrc~. System-wide programs like Vim or Emacs
have their own configuration files, like the ~.vimrc~, which allows you to add new configurations to
Vim, and add plug-ins. 

** Environment variables and user configuration

More than personalization, the ~.bash_profile~ file contains also variables relevant to system
configuration and other variables that we would like to use system wide. We called those variables,
environment variables. Just like ordinary variables in Bash, you can access them by using the ~echo~
command. Although, for creating them, you have to use the ~export~ command

#+BEGIN_SRC bash :exports both :results output
# Let's print one of the most important environment variables in the system: 
echo $PATH
#+END_SRC  

#+RESULTS:
: /usr/local/Cellar/pyenv-virtualenv/1.1.3/shims:/Users/topcat/.pyenv/shims:/Library/Frameworks/Python.framework/Versions/3.6/bin:/usr/local/bin:/usr/bin:/bin:/usr/sbin:/sbin:/Library/TeX/texbin:/opt/X11/bin:/Users/topcat/bin:/Applications/Emacs.app/Contents/MacOS/bin-x86_64-10_10:/Applications/Emacs.app/Contents/MacOS/libexec-x86_64-10_10

There are several system variables that you can modify, and also you can create new ones for your
own use. If you want to check your environment variables run ~printenv~ in the terminal.
 
#+BEGIN_SRC bash :exports both :results output
export EDITOR=vim
export DROPBOX_API_KEY=“<api key>”
export OBJC_DISABLE_INITIALIZE_FORK_SAFETY=YES
export LANG=en_US.UTF-8
export LANGUAGE=en_US.UTF-8
export DBURL='postgresql://topcat:wyqN4SD2cDf86fa4Odrs@localhost:9000/modis_luigi_pipeline'
export PATH=$HOME/bin:/usr/local/bin:$PATH
#+END_SRC  

Although all environment variables live in the ~.bash_profile~, you can ~source~ a file with all
your environment configuration. By default, MacOS will export automatically all variables in the
~~/.profile~ file, so you can store yours there.  

** Recommended configuration: 

There are literally thousands of /dotfiles/ configurations, you can check [[http://dotfiles.github.io][this]] Github repository for
new ideas and inspiration. Some basic good terminal appearance can be achieved by changing the
terminal and the shell. 

 - Terminal emulators: [[https://www.iterm2.com][iTerm]] or [[https://hyper.is][Hyper]]
 - Shell: ZSH (with [[https://github.com/robbyrussell/oh-my-zsh][oh-my-zsh]])
